---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.HostedSweepType
source: html/b9081e37-fd2e-f963-e7cc-381cbe667851.htm
---
# HostedSweepType Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.